# FamilyInstanceCreationData Constructor (Face, Line, FamilySymbol)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstanceCreationData Constructor (Face, Line, FamilySymbol)
FamilyInstanceCreationData Class See Also
---
Initializes a new instance of the FamilyInstanceCreationData class
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyInstanceCreationData(
	Face face,
	Line position,
	FamilySymbol symbol
)
```

Visual Basic
---
```text
Public Sub New ( _
	face As Face, _
	position As Line, _
	symbol As FamilySymbol _
)
```

Visual C++
---
```text
public:
FamilyInstanceCreationData(
	Face^ face,
	Line^ position,
	FamilySymbol^ symbol
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..FaceA face of a geometry object.
position
    Type: Autodesk.Revit.DB..::..LineA line on the face defining where the symbol is to be placed.
symbol
    Type: Autodesk.Revit.DB..::..FamilySymbolA FamilySymbol object that represents the type of the instance that is to be inserted.
# See Also
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace